In [28]:
# Handling the missing data
from numpy import nan as NA
import pandas as pd
df=pd.DataFrame([[1,2,4],[20,NA,30],[NA,NA,NA]])
print(df)

      0    1     2
0   1.0  2.0   4.0
1  20.0  NaN  30.0
2   NaN  NaN   NaN

In [30]:
#check the null values.
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2   True   True   True

In [31]:
#how can drop the null values.
df.dropna()

     0    1    2
0  1.0  2.0  4.0

In [35]:
# delete the row which have entire null values.
df.dropna(how="all")

      0    1     2
0   1.0  2.0   4.0
1  20.0  NaN  30.0

In [43]:
# replace the 2 with null values
df[1]=90
df

      0   1     2
0   1.0  90   4.0
1  20.0  90  30.0
2   NaN  90   NaN

In [44]:
#delete the columns which is having all the null values.
df.dropna(how="all",axis=1)

      0   1     2
0   1.0  90   4.0
1  20.0  90  30.0
2   NaN  90   NaN

In [37]:
import pandas as pd
from numpy import nan as NA
df=pd.DataFrame([[15,25,40],[10,NA,20],[NA,NA,NA]])
print(df)  
#delete the null value row if the count of non-null values is less than 3. 
# df.dropna(axis=0,thresh=2,inplace=True)

# df.dropna (how="any/all",axis=0/1,thresh=count of null values,inplace=True )

      0     1     2
0  15.0  25.0  40.0
1  10.0   NaN  20.0
2   NaN   NaN   NaN

In [39]:
# fillna(): fills missing values with a specific value or method.
#df.fillna(value)
df.fillna(0)

      0     1     2
0  15.0  25.0  40.0
1  10.0   0.0  20.0
2   0.0   0.0   0.0

In [40]:
#df.fillna(value,method-'ffill',limit=count of fill null values,inplace=True)
df.fillna(method='ffill',limit=1)

# ffill(): fills missing values using the previous valid value.

C:\Users\zuheb\AppData\Local\Temp\ipykernel_18180\2195588183.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',limit=1)

      0     1     2
0  15.0  25.0  40.0
1  10.0  25.0  20.0
2  10.0   NaN  20.0

In [41]:
# fill the null value with mean
df.fillna(df.mean())

      0     1     2
0  15.0  25.0  40.0
1  10.0  25.0  20.0
2  12.5  25.0  30.0